tap "ariga/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open-source GitLab command-line tool
brew "glab"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Platform built on V8 to build network applications
brew "node"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A database toolkit
brew "ariga/tap/atlas"
# Reimagine your terminal
cask "fig"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"

brew "lsd"
brew "python"
brew "bat"
brew "fzf"
cask "maccy"
cask "vscode"
cask "sublime-text"